---
kind: method
id: M:Autodesk.Revit.DB.ExternalResourceLoadData.Dispose
source: html/5b80b774-9bd3-10be-5524-f5eb0460c8d9.htm
---
# Autodesk.Revit.DB.ExternalResourceLoadData.Dispose Method

Releases all resources used by the ExternalResourceLoadData

## Syntax (C#)
```csharp
public void Dispose()
```